{
  "header": {
    "name": "Meysam Soheilipour",
    "address": "180 Brannan Street, #320, San Francisco, CA, 94107",
    "email": "Soheil_dot@yahoo.com",
    "phone": "(971) 267-9430"
  },
  "summary": "Growth marketing and product management executive with 10+ years of experience driving digital transformation and revenue growth across travel tech, media, and e-commerce. Adept at comprehensive market analysis, developing data-driven strategies, and leveraging AI automation, Python coding, and financial modeling to optimize performance, scale operations, and foster cross-functional collaboration. Proven track record in managing high-performance teams and executing innovative digital campaigns—from SEO/SEM to product-led growth initiatives—that consistently deliver measurable results. Analytical, data-driven, and solutions-focused leader with hybrid skill sets, passionate about integrating emerging technologies with business development strategies to enhance customer engagement and market competitiveness in remote, global environments.",
  "coreCompetencies": [
    "Growth Marketing Strategy & Digital Acquisition",
    "Market Analysis & Financial Modeling",
    "eCommerce & Brand Management",
    "Performance Optimization & ROI Improvement",
    "Product Management & Product-Led Growth",
    "Leadership & Project Management",
    "Cross-Functional Collaboration",
    "AI & Automation Integration",
    "Online Business Development",
    "Technical Project Management & Strategies"
  ],
  "technicalProficiency": {
    "programming": ["Python", "SQL", "PHP"],
    "cloudData": ["AWS", "Redshift", "S3", "SES", "LightSail", "CloudFront", "Google Big Query"],
    "analytics": ["Looker Studio", "Google Analytics", "Tag Manager", "Google Search Console"],
    "mlAi": ["Vertex AI", "Bedrock", "NeMo", "Cursor AI", "LLMs", "Pinecone", "Qdrant", "Agents"],
    "productivity": ["n8n", "Airtable", "Asana", "Zapier"],
    "marketingAds": ["AdWords", "YouTube Studio", "Facebook Ads", "TikTok Ads", "Reddit Ads", "Mailchimp", "HubSpot"]
  },
  "professionalExperience": [
    {
      "company": "Trip Ways (Remote, Worldwide)",
      "title": "Co-Founder and CEO",
      "dateRange": "01/2024 – Present",
      "bullets": [
        "Spearheaded the relaunch and scaling of TripWays.com by integrating AI-powered semantic search, chatbot assistants, vectorized travel product databases, and retrieval-augmented generation (RAG) models to enhance user experience, personalize travel recommendations, improve booking efficiency, and drive conversions.",
        "Implemented new strategies that significantly increased the inventory from 1,000 to 10,000+ travel packages and significantly increased its share of voice in the OTA industry. Enhanced B2B operations by streamlining vendor onboarding processes, fostering stronger partnership with travel-tech providers to use programmatic solutions, and expanding the network to over 500 global vendors, driving growth and operational efficiency.",
        "Optimized revenue models and monetization strategies by balancing commission structures (20-40%) and transaction fees to maximize profitability and drive sales growth, leveraging AI-driven marketing strategies across video ads, in-destination Ads, and travel-specific ad networks to increase user acquisition and ROI.",
        "Led a team of developers to rebuild platform architecture, integrating big data processing, AI-powered engineering, and personalization optimization, while spearheading technical project management to align engineering workflows and business developments with data-driven growth strategies.",
        "Developed tools and workflows for a cross-functional team of 10, fostering collaboration across 60 destinations and achieving seamless global operations."
      ]
    },
    {
      "company": "Setare E-Commerce Co. (Tehran, Iran)",
      "title": "Co-Founder / Director of Growth Marketing / CTO",
      "dateRange": "04/2015 – 06/2019",
      "bullets": [
        "Co-founded and grew a company of 50 personnel, overseeing operations, growth marketing, and technical strategy from inception to becoming a top-ranked platform.",
        "Designed and developed an online platform featuring 55,000 unique resources (articles, podcasts, forums, and online materials in Farsi) across 800+ categories, attracting 10M monthly visitors and achieving a global website ranking of 999 (top 20 in Iran) within 3 years.",
        "Held a pivotal role in planning content management strategies that resulted in +15M monthly sessions (80% organic traffic), ranking the platform among the top 50 websites in Iran and top 2000 globally (Alexa Ranking).",
        "Recruited, managed, and led a cross-functional team of SEO specialists, copywriters, and developers, optimizing workflows to enhance efficiency and performance.",
        "Planned and implemented marketing strategies and business operations, focusing on keyword research, content optimization, monetization, and SEO/SEM techniques, driving sustainable growth.",
        "Managed a large-scale migration of data from the old CMS to a WordPress platform on self-managed AWS servers, reducing server costs by 40% while improving user experience and workflows.",
        "Overcame infrastructure challenges in a developing country by implementing innovative solutions and continuous system improvements to support scalability and growth."
      ]
    },
    {
      "company": "Nilgasht Travel Agency (Tehran, Iran)",
      "title": "Digital Marketing Manager / CRM Project Manager",
      "dateRange": "01/2015 – 09/2016",
      "bullets": []
    },
    {
      "company": "Hamrah Ltd. (London, UK)",
      "title": "Jr. Digital Marketer / Web Publisher / Copywriter / Graphic Designer",
      "dateRange": "04/2013 – 02/2016",
      "bullets": []
    }
  ],
  "education": [
    {
      "school": "Tehran University (Tehran, Iran)",
      "dateRange": "09/2013 – 11/2015",
      "degree": "Master of Business Management; Minor in Marketing"
    },
    {
      "school": "Shahrekord University (Shahrekord, Iran)",
      "dateRange": "09/2006 – 07/2010",
      "degree": "Bachelor of Science, Mechanical Engineering"
    }
  ],
  "certifications": [
    "Google Analytics Certification, 07/2017",
    "Google Tag Manager Certification, 07/2017",
    "Google Search Certification, 07/2017"
  ]
} 